In [5]:
import pandas as pd 
df = pd.read_csv("practice.csv", skiprows=1)
df

   count  average  median
0      1        3       4
1      2        2       1

In [9]:
df = pd.read_csv("practice.csv", header=1)
df

   count  average  median
0      1        3       4
1      2        2       1

In [15]:
df = pd.read_csv("practice.csv", skiprows=1, names=["count","average","median"])
df

   count  average  median
0      1        3       4
1      2        2       1

In [18]:
df = pd.read_csv("practice.csv", header=None, names=["count","average","median"])
df

   count  average  median
0      1        3       4
1      2        2       1

In [21]:
df = pd.read_csv("practice.csv", nrows=0)
df

Empty DataFrame
Columns: [1, 3, 4]
Index: []

In [23]:
df = pd.read_csv("practice.csv", na_values=["n.a","na"])
df

    sum  count2  count3
0   NaN     3.0     4.0
1  -3.0    -4.0     1.0
2  43.0     NaN     NaN

In [26]:
df = pd.read_csv("practice.csv", na_values={
    'sum': "na",
    'count2':["n.a","-4"],
    'count3':"na"
})
df

    sum  count2  count3
0   NaN     3.0     4.0
1  -3.0     NaN     1.0
2  43.0     NaN     NaN

In [28]:
#before running this close the file
df.to_csv('new.csv',index=False)

In [29]:
df.columns

Index(['sum', 'count2', 'count3'], dtype='object')

In [31]:
df.to_csv('new.csv',index=False,columns=['sum', 'count2'])

In [32]:
df.to_csv('new.csv',index=False,columns=['sum', 'count2'], header=False)

In [41]:
#by default it will choose the first sheet unless we ask to use another 
df=pd.read_excel("Employee.xlsx","גיליון1")

In [43]:
df=pd.read_excel("Employee.xlsx")
df

  vxc   v
0   d  ds

In [52]:
def conver_data (cell):
    if cell=="NaN":
        return None
    return cell
df=pd.read_excel("Employee.xlsx", converters ={
    'EmployeeID': conver_data,
    'FullName': conver_data,
    'DepartmentName': conver_data
})
df

    EmployeeID   FullName    DepartmentName
0       3540.0       None              None
1       3844.0  עובד 1245   קבוצה לדוגמא 39
2          NaN  עובד 3360   קבוצה לדוגמא 56
3       7318.0  עובד 3168  קבוצה לדוגמא 122
4       4110.0  עובד 3181   קבוצה לדוגמא 81
..         ...        ...               ...
77      3073.0  עובד 2146   קבוצה לדוגמא 39
78      7785.0  עובד 3859  קבוצה לדוגמא 121
79      8489.0  עובד 4116   קבוצה לדוגמא 69
80      8740.0  עובד 4337   קבוצה לדוגמא 68
81      4962.0  עובד 1400   קבוצה לדוגמא 56

[82 rows x 3 columns]

In [56]:
df.to_excel("newOne.xlsx", sheet_name="d", startrow=1, startcol=2)

In [60]:
# write 2 sheets to a file 
df_first_sheet = df
df_second_seet = pd.read_excel("Employee.xlsx")
with pd.ExcelWriter ('merge.xlsx') as writer:
    df_first_sheet.to_excel(writer, sheet_name="first")
    df_second_seet.to_excel(writer, sheet_name="second")